### Aula 1 - Analise de Dados Python

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [3]:
df.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [5]:
df.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [6]:
df.shape

(133349, 11)

In [7]:
linhas, colunas = df.shape[0], df.shape[1]
print(f"A base de dados possui {linhas} linhas e {colunas} colunas")

A base de dados possui 133349 linhas e 11 colunas

In [8]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [9]:
renomear_colunas = {
    'work_year':'ano',
    'experience_level':'senioridade',
    'employment_type':'contrato',
    'job_title':'cargo',
    'salary':'salario',
    'salary_currency':'salario',
    'salary_in_usd':'dolar',
    'employee_residence':'residencia',
    'remote_ratio':'remoto',
    'company_location':'localizacao',
    'company_size':'empresa'
}
df.rename(columns=renomear_colunas, inplace=True)
df.columns

Index(['ano', 'senioridade', 'contrato', 'cargo', 'salario', 'salario',
       'dolar', 'residencia', 'remoto', 'localizacao', 'empresa'],
      dtype='object')

In [10]:
df["senioridade"].value_counts()

senioridade
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

In [11]:
df["contrato"].value_counts()

contrato
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [12]:
df["remoto"].value_counts()

remoto
0      105312
100     27718
50        319
Name: count, dtype: int64

In [13]:
df["empresa"].value_counts()

empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

In [14]:
senioridade = {
    'SE': 'Senior' ,
    'MI': 'Pleno' ,
    'EN': 'Junior' ,
    'EX': 'Executive'
}

df["senioridade"] = df["senioridade"].replace(senioridade)
df["senioridade"].value_counts()

senioridade
Senior       77241
Pleno        40465
Junior       12443
Executive     3200
Name: count, dtype: int64

In [15]:
contrato = {
    'FT': 'Tempo Integral',
    'CT': 'Contrato',
    'PT': 'Tempo Parcial',
    'FL': 'Freelancer'
}

df["contrato"] = df["contrato"].map(contrato)
df["contrato"].value_counts()

contrato
Tempo Integral    132563
Contrato             394
Tempo Parcial        376
Freelancer            16
Name: count, dtype: int64

In [16]:
empresa = {
    'S': 'Pequena',
    'M': 'Média',
    'L': 'Grande'
}

df["empresa"] = df["empresa"].map(empresa)
df["empresa"].value_counts()

empresa
Média      129561
Grande       3574
Pequena       214
Name: count, dtype: int64

In [17]:
traducao_remoto = {
    0: 'Presencial',
    100: 'Remoto',
    50: 'Híbrido'
}

df["remoto"] = df["remoto"].map(traducao_remoto)
df["remoto"].value_counts()

remoto
Presencial    105312
Remoto         27718
Híbrido          319
Name: count, dtype: int64

In [18]:
df.head()

,ano,senioridade,contrato,cargo,salario,salario,dolar,residencia,remoto,localizacao,empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Média
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Média
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Média
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Média
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Média

In [19]:
df.describe(include='object')

,senioridade,contrato,cargo,salario,residencia,remoto,localizacao,empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,Senior,Tempo Integral,Data Scientist,USD,US,Presencial,US,Média
freq,77241,132563,17314,126140,119579,105312,119641,129561

In [20]:
df.describe()

                 ano       salario          dolar
count  133339.000000  1.333490e+05  133349.000000
mean     2024.358770  1.632833e+05  157617.272098
std         0.680627  2.173860e+05   74288.363097
min      2020.000000  1.400000e+04   15000.000000
25%      2024.000000  1.060200e+05  106000.000000
50%      2024.000000  1.470000e+05  146206.000000
75%      2025.000000  1.990000e+05  198000.000000
max      2025.000000  3.040000e+07  800000.000000

### Aula 2 - Preparação e limpeza dos Dados

In [21]:
# Analisar valores nulos/ausentes
df.isnull()

,ano,senioridade,contrato,cargo,salario,salario,dolar,residencia,remoto,localizacao,empresa
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
133344,False,False,False,False,False,False,False,False,False,False,False
133345,False,False,False,False,False,False,False,False,False,False,False
133346,False,False,False,False,False,False,False,False,False,False,False
133347,False,False,False,False,False,False,False,False,False,False,False
133348,False,False,False,False,False,False,False,False,False,False,False

In [22]:
# Analisar a base de dados
df.head()

,ano,senioridade,contrato,cargo,salario,salario,dolar,residencia,remoto,localizacao,empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Média
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Média
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Média
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Média
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Média

In [23]:
# Somar todos os campos que possuem valores nulos
df.isnull().sum()

ano            10
senioridade     0
contrato        0
cargo           0
salario         0
salario         0
dolar           0
residencia      0
remoto          0
localizacao     0
empresa         0
dtype: int64

In [24]:
# Trazer os valores únicos da coluna 'ano'
df['ano'].unique()

array([2025.,   nan, 2024., 2022., 2023., 2020., 2021.])

In [25]:
# Filtrar registros com valores nulos na coluna 'ano'
df[df.isnull().any(axis=1)]

,ano,senioridade,contrato,cargo,salario,salario,dolar,residencia,remoto,localizacao,empresa
5588,NaN,Senior,Tempo Integral,Product Manager,184500,USD,184500,US,Presencial,US,Média
59692,NaN,Pleno,Tempo Integral,Engineer,110000,USD,110000,DE,Presencial,DE,Média
59710,NaN,Junior,Tempo Integral,Data Scientist,208800,USD,208800,US,Presencial,US,Média
59759,NaN,Senior,Tempo Integral,Software Engineer,135000,USD,135000,US,Presencial,US,Média
59789,NaN,Senior,Tempo Integral,Engineer,112000,USD,112000,US,Presencial,US,Média
131000,NaN,Senior,Tempo Integral,Machine Learning Engineer,163800,USD,163800,US,Presencial,US,Média
131006,NaN,Senior,Tempo Integral,Data Analytics Manager,204500,USD,204500,US,Presencial,US,Média
133054,NaN,Junior,Tempo Integral,Data Scientist,40000,USD,40000,JP,Remoto,MY,Grande
133281,NaN,Pleno,Tempo Integral,Machine Learning Engineer,180000,PLN,46597,PL,Remoto,PL,Grande
133317,NaN,Pleno,Tempo Integral,Data Scientist,130000,USD,130000,US,Híbrido,US,Grande

In [26]:
#Importar numpy para manipulação de dados numericos
import numpy as np

In [27]:
#Analisando salarios
# Criar um DataFrame
df_salarios = pd.DataFrame({
'nome': ['Ana', 'Bruno', 'Carlos', 'Daniele', 'val'],
'salario': [4000, np.nan, 5000, np.nan, 100000],
})

# Calcular a média salarial e substituir valores nulos pela média e arrendondar os valores
df_salarios['salario_medio'] = df_salarios['salario'].fillna(df_salarios['salario'].mean().round(2))
# calcular a mediana salarial e substituir valores nulos pela mediana
df_salarios['salario_mediana'] = df_salarios['salario'].fillna(df_salarios['salario'].median())

df_salarios

      nome   salario  salario_medio  salario_mediana
0      Ana    4000.0        4000.00           4000.0
1    Bruno       NaN       36333.33           5000.0
2   Carlos    5000.0        5000.00           5000.0
3  Daniele       NaN       36333.33           5000.0
4      val  100000.0      100000.00         100000.0

In [28]:
#Analisando salarios
# Criar um DataFrame
df_salarios = pd.DataFrame({
'nome': ['Ana', 'Bruno', 'Carlos', 'Daniele', 'val'],
'salario': [4000, np.nan, 5000, np.nan, 100000],
})

# Calcular a média salarial e substituir valores nulos pela média e arrendondar os valores
df_salarios['salario_medio'] = df_salarios['salario'].fillna(df_salarios['salario'].mean().round(2))
# calcular a mediana salarial e substituir valores nulos pela mediana
df_salarios['salario_mediana'] = df_salarios['salario'].fillna(df_salarios['salario'].median())

df_salarios

      nome   salario  salario_medio  salario_mediana
0      Ana    4000.0        4000.00           4000.0
1    Bruno       NaN       36333.33           5000.0
2   Carlos    5000.0        5000.00           5000.0
3  Daniele       NaN       36333.33           5000.0
4      val  100000.0      100000.00         100000.0

In [29]:
# Analisando temperaturas
df_temperaturas = pd.DataFrame({
    'dia': ['Segunda', 'Terça', 'Quarta', 'Quinta', 'Sexta'],
    'temperatura': [30, np.nan, np.nan, 28, 27]
    })

# Usando Bfill (PREENCHE COM VALORES POSTERIORES)
df_temperaturas['preenchido_bfill'] = df_temperaturas['temperatura'].bfill()

df_temperaturas

       dia  temperatura  preenchido_bfill
0  Segunda         30.0              30.0
1    Terça          NaN              28.0
2   Quarta          NaN              28.0
3   Quinta         28.0              28.0
4    Sexta         27.0              27.0

In [30]:
#Analisando cidades
df_cidades = pd.DataFrame({
    'nome': ['Ana', 'Bruno', 'Carlos', 'Daniele', 'val'],
    'cidade': ['São Paulo', np.nan, 'Curitiba', np.nan, 'Belém'],
})

# Preencher valores nulos na coluna 'cidade' com 'Não Informado'
df_cidades['cidade_preenchida'] = df_cidades['cidade'].fillna('Não Informado')
display(df_cidades)

      nome     cidade cidade_preenchida
0      Ana  São Paulo         São Paulo
1    Bruno        NaN     Não Informado
2   Carlos   Curitiba          Curitiba
3  Daniele        NaN     Não Informado
4      val      Belém             Belém

In [31]:
df_limpo = df.dropna()

In [32]:
df_limpo.isnull().sum()

ano            0
senioridade    0
contrato       0
cargo          0
salario        0
salario        0
dolar          0
residencia     0
remoto         0
localizacao    0
empresa        0
dtype: int64

In [33]:
df_limpo.head()

,ano,senioridade,contrato,cargo,salario,salario,dolar,residencia,remoto,localizacao,empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Média
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Média
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Média
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Média
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Média

In [34]:
df_limpo.info()

<class 'pandas.core.frame.DataFrame'>
Index: 133339 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   ano          133339 non-null  float64
 1   senioridade  133339 non-null  object
 2   contrato     133339 non-null  object
 3   cargo        133339 non-null  object
 4   salario      133339 non-null  int64
 5   salario      133339 non-null  object
 6   dolar        133339 non-null  int64
 7   residencia   133339 non-null  object
 8   remoto       133339 non-null  object
 9   localizacao  133339 non-null  object
 10  empresa      133339 non-null  object
dtypes: float64(1), int64(2), object(8)
memory usage: 12.2+ MB

In [35]:
# Converter a coluna 'ano' para o tipo int64
# Isso é necessário para garantir que a coluna 'ano' seja tratada como um número inteiro
df_limpo = df_limpo.assign(ano = df_limpo['ano'].astype('int64'))

In [36]:
df_limpo.head()

,ano,senioridade,contrato,cargo,salario,salario,dolar,residencia,remoto,localizacao,empresa
0,2025,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Média
1,2025,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Média
2,2025,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Média
3,2025,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Média
4,2025,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Média

In [37]:
df_limpo.info()

<class 'pandas.core.frame.DataFrame'>
Index: 133339 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   ano          133339 non-null  int64
 1   senioridade  133339 non-null  object
 2   contrato     133339 non-null  object
 3   cargo        133339 non-null  object
 4   salario      133339 non-null  int64
 5   salario      133339 non-null  object
 6   dolar        133339 non-null  int64
 7   residencia   133339 non-null  object
 8   remoto       133339 non-null  object
 9   localizacao  133339 non-null  object
 10  empresa      133339 non-null  object
dtypes: int64(3), object(8)
memory usage: 12.2+ MB

### Aula 3 - Visualização de Dados

In [38]:
df_limpo.head()

,ano,senioridade,contrato,cargo,salario,salario,dolar,residencia,remoto,localizacao,empresa
0,2025,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Média
1,2025,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Média
2,2025,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Média
3,2025,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Média
4,2025,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Média

In [39]:
df_limpo['senioridade'].value_counts().plot(kind='bar', title='distribuição de senioridade')

ImportError: matplotlib is required for plotting when the default backend "matplotlib" is selected.